## Structured Query Language (SQL) & Relational Algebra

### Relational Algebra

> Relational algebra, first created by Edgar F. Codd while at IBM, is a family of algebras with a well-founded semantics used for modelling the data stored in relational databases, and defining queries on it.  
The main application of relational algebra is providing a theoretical foundation for relational databases, particularly query languages for such databases, chief among which is SQL. [[1]](https://en.wikipedia.org/wiki/Relational_algebra)

![alt text](img/re_alg_1.png "Some operators of relational algebra")

An operator is:
   - Primitive: if it cannot be defined using other operators.
   - Derivative: if it can be defined using other operators.
   
Depending on the number of sets an operator works with, the operator can be:
   - Unary.
   - Binary.

### Structured Query Language

![alt img](img/NtGaNA8.png "How to pronunce SQL")

[[Source]](https://www.reddit.com/r/ProgrammerHumor/comments/7z0eoj/how_to_pronounce_sql/)

> SQL (Structured Query Language) is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is particularly useful in handling structured data where there are relations between different entities/variables of the data. SQL offers two main advantages over older read/write APIs like ISAM or VSAM. First, it introduced the concept of accessing many records with one single command; and second, it eliminates the need to specify how to reach a record, e.g. with or without an index.

> Originally based upon relational algebra and tuple relational calculus, SQL consists of many types of statements, which may be informally classed as sublanguages, commonly: a data query language (DQL), a data definition language (DDL), a data control language (DCL), and a data manipulation language (DML). The scope of SQL includes data query, data manipulation (insert, update and delete), data definition (schema creation and modification), and data access control. Although SQL is often described as, and to a great extent is, a declarative language (4GL), it also includes procedural elements.

> SQL was one of the first commercial languages for Edgar F. Codd's relational model. The model was described in his influential 1970 paper, "A Relational Model of Data for Large Shared Data Banks". Despite not entirely adhering to the relational model as described by Codd, it became the most widely used database language.

> SQL became a standard of the American National Standards Institute (ANSI) in 1986, and of the International Organization for Standardization (ISO) in 1987. Since then, the standard has been revised to include a larger set of features. Despite the existence of such standards, most SQL code is not completely portable among different database systems without adjustments. [[8]](https://en.wikipedia.org/wiki/SQL)

### Relational algebra: Set operators

#### Union $\cup$

> $A  \cup B = \{ x: x \in A \text{  or  } x \in B\}$  

> Example:  
$\{0, 1, a\} \cup \{0, b\} = \{0, 1, a, b\}$


<table align="center">
<tr></tr>
<tr><td>
    
**<center> Cars1 </center>**

| License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| R2D2C3  | KIA     | Blue   | 2007 | 3     |
| P0BB8Y  | Ford    | Yellow | 2014 | 3     |
| 0D4LUK  | BMW     | Green  | 2009 | 5     |

</td><td>
 
</td><td>
    
**<center> Cars2 </center>**

| License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| 0D4LUK  | BMW     | Green  | 2009 | 5     |
| 35KYW4  | BMW     | Blue   | 2009 | 4     |

</td></tr>
</table>


> <center>$Cars1 \cup Cars2$:</center>

> | License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| R2D2C3  | KIA     | Blue   | 2007 | 3     |
| P0BB8Y  | Ford    | Yellow | 2014 | 3     |
| 0D4LUK  | BMW     | Green  | 2009 | 5     |
| 35KYW4  | BMW     | Blue   | 2009 | 4     |

#### Intersection $\cap$

> $A \cap B = \{ x: x \in A \text{ and } x \in B\}$.

> Example:  
$\{0, 1, a\} \cap \{0, A\} = \{0\}$

<table align="center">
<tr></tr>
<tr><td>
Cars1

| License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| R2D2C3  | KIA     | Blue   | 2007 | 3     |
| P0BB8Y  | Ford    | Yellow | 2014 | 3     |
| 0D4LUK  | BMW     | Green  | 2009 | 5     |

</td><td>

</td><td>
Cars2

| License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| 0D4LUK  | BMW     | Green  | 2009 | 5     |
| 35KYW4  | BMW     | Blue   | 2009 | 4     |

</td></tr>
</table>

> <center>$Cars1 \cap Cars2$:</center>

> | License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| 0D4LUK  | BMW     | Green  | 2009 | 5     |

#### Difference $\setminus$

> If $A$ and $B$ are sets, then the **relative complement** of $A$ in $B$, also termed the **set difference** of $B$ and $A$, is the set of elements in $B$ but not in $A$.
> The relative complement of $A$ in $B$ is denoted $B \setminus A$ according to the ISO 31-11 standard. It is sometimes written $B − A$, but this notation is ambiguous, as in some contexts it can be interpreted as the set of all elements $b − a$, where $b$ is taken from $B$ and $a$ from $A$.  

>Formally:  
$ B\setminus A=\{x\in B\mid x\notin A\}$  

>Example:  
$\{1,2,3\}\setminus \{2,3,4\}=\{1\}$.  


<table align="center">
<tr></tr>
<tr><td>
Cars1

| License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| R2D2C3  | KIA     | Blue   | 2007 | 3     |
| P0BB8Y  | Ford    | Yellow | 2014 | 3     |
| 0D4LUK  | BMW     | Green  | 2009 | 5     |


</td><td>

</td><td>
Cars2

| License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| 0D4LUK  | BMW     | Green  | 2009 | 5     |
| 35KYW4  | BMW     | Blue   | 2009 | 4     |

</td></tr>
</table>


> <center>$Cars1 \setminus Cars2$:</center>

> | License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| R2D2C3  | KIA     | Blue   | 2007 | 3     |
| P0BB8Y  | Ford    | Yellow | 2014 | 3     |

#### Cartesian product $\times$

> $A\times B = \{\,(a,b)\mid a\in A \ \mbox{ and } \ b\in B\,\}$.  

> Example:  
$\{a, 3\} \times \{0, j, 1\} = \{(a, 0), (a, j), (a, 1), (3, 0), (3, j), (3, 1)\}$

> Example:

<table align="center">
<tr></tr>
<tr><td>
Employers  

| Name  | Surname |
|-------|---------|
| Bill  | García  |
| María | Gates   |

</td><td>

</td><td>
Tasks  

| Task          | Time |
|---------------|------|
| Code DB       | 3    |
| Implement app | 30   |

</td></tr>
</table>


><center>$Employers \times Tasks$:</center>  

>| Name  | Surname | Task          | Time |
|-------|---------|---------------|------|
| Bill  | García  | Code DB       | 3    |
| Bill  | García  | Implement app | 30   |
| María | Gates   | Code DB       | 3    |
| María | Gates   | Implement app | 30   |

### Projection $\Pi$

> A projection is a unary operation written as $\Pi_{a_1, \ldots,a_n}( R )$ where $a_1,\ldots,a_n$ is a set of attribute names. The result of such projection is defined as the set that is obtained when all tuples in $R$ are restricted to the set $\{a_1,\ldots,a_n\}$.

> Note: when implemented in SQL standard the "default projection" returns a multiset instead of a set, and the $\Pi$ projection is obtained by the addition of the `DISTINCT` keyword to eliminate duplicate data.

> Example:
Cars

> | License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| R2D2C3  | KIA     | Blue   | 2007 | 3     |
| P0BB8Y  | Ford    | Yellow | 2014 | 3     |
| 0D4LUK  | BMW     | Green  | 2009 | 5     |
| 35KYW4  | BMW     | Blue   | 2009 | 4     |
| LK3RW0  | Renault | Brown  | 2011 | 5     |
| 0K13SW  | KIA     | Blue    | 2012 | 5     |

> <center>$\Pi_{Brand, Color}( Cars )$</center>

> | Brand   | Color  |
|---------|--------|
| KIA     | Blue   |
| Ford    | Yellow |
| BMW     | Green  |
| BMW     | Blue   |
| Renault | Brown  |

> There are 2 blue KIAs, but since the result is a set, it can't have duplicates.

> More formally the semantics of projection are defined as follows:

> $\Pi_{a_1, ...,a_n}( R ) = \{  \ t[a_1,...,a_n] : \ t \in R \ \}$  

> where $t[a_1,...,a_n]$ is the restriction of the tuple $t$ to the set $\{a_1,...,a_n\}$ so that  
$t[a_1,...,a_n] = \{ \ ( a', v ) \ | \ ( a', v ) \in t, \ a' \in \{a_1,...,a_n \} \}$  

> where $(a', v)$ is an attribute value, $a'$ is an attribute name, and $v$ is an element of that attribute's domain.

> The result of a projection $\Pi_{a_1, ...,a_n}( R )$ is defined only if $\{a_1,...,a_n\}$ is a subset of the header of $R$.  
Projection over no attributes at all is possible, yielding a relation of degree zero. In this case the cardinality of the result is zero if the operand is empty, otherwise one. The two relations of degree zero are the only ones that cannot be depicted as tables.

### Selection $\sigma$

> A selection (sometimes called a *restriction* in reference to E.F. Codd's 1970 paper and not, contrary to a popular belief, to avoid confusion with SQL's use of SELECT, since Codd's article predates the existence of SQL) is a unary operator that denotes a subset of a relation.

> A selection is written as
$\sigma_{a \theta b}( R )$ or $\sigma_{a \theta v}( R )$ where:
* $a$ and $b$ are attribute names.
* $\theta$ is a binary operation in the set $\{\;<, \le, =, \ne, \ge, \;>\}$
* $v$ is a value constant
* $R$ is a relation

> The selection $\sigma_{a \theta b}( R )$ denotes all tuples in $R$ for which $\theta$ holds between the $a$ and the $b$ attribute.

> The selection $\sigma_{a \theta v}( R )$ denotes all tuples in $R$ for which $\theta$ holds between the $a$ attribute and the value $v$.

> More formally the semantics of the selection is defined as
follows:

> $\sigma_{a \theta b}( R ) = \{\ t : t \in R,\ t(a) \ \theta \ t(b) \ \}$

> $\sigma_{a \theta v}( R ) = \{\ t : t \in R,\ t(a) \ \theta \ v \ \}$

> The result of the selection is only defined if the attribute names that it mentions are in the heading of the relation that it operates upon.

#### Generalized selection

> A generalized selection is a unary operation written as $\sigma_\varphi(R)$ where $\varphi$ is a propositional formula that consists of atoms as allowed in the normal selection and, in addition, the logical operators &and; (and), &or; (or) and $\lnot$ (negation). This selection selects all those tuples in $R$ for which $\varphi$ holds.

> Formally the semantics of the generalized selection is defined as follows:

> $\sigma_\varphi(R) = \{ \ t : t \in R, \ \varphi(t) \ \}$

> The result of the selection is only defined if the attribute names that it mentions are in the header of the relation that it operates upon.

> The generalized selection is expressible with other basic algebraic operations. A simulation of generalized selection using the fundamental operators is defined by the following rules:

> $\sigma_{\varphi \land \psi}(R) = \sigma_\varphi(R) \cap \sigma_\psi(R)$  
> $\sigma_{\varphi \lor \psi}(R) = \sigma_\varphi(R) \cup \sigma_\psi(R)$  
> $\sigma_{\lnot \varphi}(R) = R - \sigma_\varphi(R)$

> Cars:  

> | License | Brand   | Color  | Year | Doors |
|---------|---------|--------|------|-------|
| R2D2C3  | KIA     | Blue   | 2007 | 3     |
| P0BB8Y  | Ford    | Yellow | 2014 | 3     |
| 0D4LUK  | BMW     | Green  | 2009 | 5     |
| 35KYW4  | BMW     | Blue   | 2009 | 4     |
| LK3RW0  | Renault | Brown  | 2011 | 5     |
| 0K13SW  | KIA     | Blue   | 2012 | 5     |

> <center>$\sigma_{\text{Year} \ge 2010 \ \land \ \text{Doors} \ge 4}(\text{Cars})$</center>

> | License | Brand   | Color | Year | Doors |
|---------|---------|-------|------|-------|
| LK3RW0  | Renault | Brown | 2011 | 5     |
| 0K13SW  | KIA     | Blue  | 2012 | 5     |

### <mark>Simple queries in SQL</mark>

In [1]:
#load ipython-sql
%load_ext sql

In [2]:
# Option2: Hide password using getpass
#database dumpexercise
import getpass
user = 'root'
password = getpass.getpass()
#world ->dummydataset
connection_string = f'mysql+pymysql://{user}:{password}@localhost:3306/newname'
%sql $connection_string

········
(pymysql.err.OperationalError) (2003, "Can't connect to MySQL server on 'localhost' ([WinError 10061] No connection could be made because the target machine actively refused it)")
(Background on this error at: http://sqlalche.me/e/13/e3q8)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

http://g2pc1.bu.edu/~qzpeng/manual/MySQL%20Commands.htm

In [11]:
%%sql
show databases;

 * mysql+pymysql://root:***@localhost:3306/newname
8 rows affected.

[('ai_engineer',),
 ('dbcompleta',),
 ('information_schema',),
 ('mysql',),
 ('new_schema3',),
 ('newname',),
 ('performance_schema',),
 ('sys',)]

In [7]:
%%sql
show tables

 * mysql+pymysql://root:***@localhost:3306/newname
13 rows affected.

[('countries',),
 ('countries2',),
 ('countries3',),
 ('countries4',),
 ('departments',),
 ('employees',),
 ('job_history',),
 ('jobs',),
 ('locations',),
 ('regions',),
 ('users',),
 ('view1',),
 ('viewx',)]

- In a query, 2 statements are mandatory:
    - `SELECT` and `FROM`.
- The result returned from a query is a table.

#### <mark>SELECT & FROM</mark>

`SELECT` specifies the list of attributes that we want to draw (the name of the columns).  
`FROM` refers to the name of the table which has the selected attributes.  
`*` indicates that we want to select all the columns from a table.

This query will return a table of `n` rows and 2 columns:

```mysql
SELECT column_name_1, column_name2
FROM table_name;

```

This query will return a table with all the columns of the `table_name` table:

```mysql
SELECT * FROM table_name;
```

##### <mark>SELECT DISTINCT</mark>

If we want unique results from our query, we must use the `DISTINCT` statement.

**<center>users</center>**

| name  | <u>id</u> | country | username  | telephone | id_loc |
|-------|-----------|---------|-----------|-----------|--------|
| John  | 12        | UK      | johnny    | 213321400 | 21     |
| Sarah | 33        | UK      | sara      | 544598288 | 3      |
| Alice | 9         | UK      | aliwonder | 677688998 | 6      |
| Roger | 2         | France  | rogrog    | 343444343 | 3      |

```mysql 
SELECT country 
FROM users;
```

In [8]:
%%sql SELECT country
FROM users;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[('France',), ('UK',), ('UK',), ('UK',)]

```mysql 
SELECT DISTINCT country 
FROM users;
```

In [10]:
%%sql 
SELECT DISTINCT country
FROM users;

 * mysql+pymysql://root:***@localhost:3306/newname
2 rows affected.

[('France',), ('UK',)]

##### <mark>More examples on SELECT</mark>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

In [12]:
%%sql 
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', None, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

```mysql
SELECT emp, target, sales, (sales-target)
FROM employees;
```

In [13]:
%%sql
SELECT emp, target, sales, (sales-target) 
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[('Donald', 6000, 5500, -500),
 ('Charlie', 3000, 1500, -1500),
 ('Bob', 2000, None, None),
 ('Alice', 4000, 4300, 300)]

In [14]:
%%sql
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', None, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

```mysql
SELECT emp, (salary*1.025) 
FROM employees;
```

In [10]:
%%sql 
SELECT emp, salary,(salary*1.025)
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[('Donald', 4000, Decimal('4100.000')),
 ('Charlie', 2000, Decimal('2050.000')),
 ('Bob', 1750, Decimal('1793.750')),
 ('Alice', 2000, Decimal('2050.000'))]

```mysql
SELECT emp, contract_date, MONTH(contract_date), YEAR(contract_date)
FROM employees;
```

In [15]:
%%sql 
SELECT emp, contract_date, MONTH(contract_date), YEAR(contract_date)
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[('Donald', datetime.datetime(2017, 4, 2, 0, 0), 4, 2017),
 ('Charlie', datetime.datetime(2016, 10, 27, 0, 0), 10, 2016),
 ('Bob', datetime.datetime(2000, 8, 19, 0, 0), 8, 2000),
 ('Alice', datetime.datetime(2018, 2, 23, 0, 0), 2, 2018)]

#### <mark>WHERE</mark>

The conditional options are placed after the `WHERE` clause. Only the instances (or rows) that make true the condition/s are included (`NULL`s are not) in the result.
There are different kinds of conditional clauses:
- Comparison.
- Range.
- Belonging to a set.
- Pattern match.
- `NULL` value.

##### <mark>COMPARISON (=, >, <, >=, <=, <>)</mark>

Allow us to compare the value of an attribute with a constant value, an arithmetic expression, ...

| Operator | Description           |
|----------|-----------------------|
| `=`      | Equal to              |
| `>`      | Greater than          |
| `<`      | Less than             |
| `>=`     | Greater than equal to |
| `<=`     | Less than equal to    |
| `<>`     | Not equal to          |

Examples:

**<center>users</center>**

| name  | <u>id</u> | country | username  | telephone | id_loc |
|-------|-----------|---------|-----------|-----------|--------|
| John  | 12        | UK      | johnny    | 213321400 | 21     |
| Sarah | 33        | UK      | sara      | 544598288 | 3      |
| Alice | 9         | UK      | aliwonder | 677688998 | 6      |
| Roger | 2         | France  | rogrog    | 343444343 | 3      |

In [16]:
%%sql SELECT *
FROM users;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[('Roger', 2, 'France', 'rogrog', '343444343', 3),
 ('Alice', 9, 'UK', 'aliwonder', '677688998', 6),
 ('John', 12, 'UK', 'johnny', '213321400', 21),
 ('Sarah', 33, 'UK', 'sara', '544598288', 3)]

```mysql
SELECT name, telephone
FROM users
WHERE id = 33;
```

In [13]:
%%sql SELECT name, telephone
FROM users
WHERE id=33;

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[('Sarah', '544598288')]

In [146]:
%%sql SELECT name, telephone

FROM users
WHERE id=33

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
1 rows affected.

[('Sarah', '544598288')]

```mysql
SELECT name, telephone, id_loc
FROM users
WHERE name <> 'Sarah';
```

In [19]:
%%sql 
SELECT name, telephone, id_loc
FROM users
WHERE name <> 'Sarah'
LIMIT 2
#Va al final

 * mysql+pymysql://root:***@localhost:3306/newname
2 rows affected.

[('Roger', '343444343', 3), ('Alice', '677688998', 6)]

##### <mark>BETWEEN</mark>

Checks if the value of the attribute is in *between* 2 values.
```mysql
SELECT *
FROM my_table
WHERE my_value BETWEEN
0 AND 100;
```

In [20]:
%%sql SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', None, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

In [21]:
%%sql 
SELECT *
FROM employees
WHERE salary BETWEEN
2000 AND 4000;

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

It's equivalent to:

```mysql
SELECT *
FROM my_table
WHERE (my_value>=0) AND (my_value<=100);
```

In [22]:
%%sql
SELECT *
FROM employees
WHERE (salary>=2000) AND (salary<=4000)

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

It also works with dates:
```mysql
SELECT name
FROM users
WHERE birthday BETWEEN
'01/08/2019' AND '31/10/2019';
```

In [23]:
%%sql 
show tables;

 * mysql+pymysql://root:***@localhost:3306/newname
13 rows affected.

[('countries',),
 ('countries2',),
 ('countries3',),
 ('countries4',),
 ('departments',),
 ('employees',),
 ('job_history',),
 ('jobs',),
 ('locations',),
 ('regions',),
 ('users',),
 ('view1',),
 ('viewx',)]

In [23]:
%%sql
SELECT *
FROM job_history

 * mysql+pymysql://root:***@localhost:3306/newname
11 rows affected.

[(Decimal('102'), datetime.date(1993, 1, 13), datetime.date(1998, 7, 24), 'IT_PROG', Decimal('60')),
 (Decimal('101'), datetime.date(1989, 9, 21), datetime.date(1993, 10, 27), 'AC_ACCOUNT', Decimal('110')),
 (Decimal('101'), datetime.date(1993, 10, 28), datetime.date(1997, 3, 15), 'AC_MGR', Decimal('110')),
 (Decimal('201'), datetime.date(1996, 2, 17), datetime.date(1999, 12, 19), 'MK_REP', Decimal('20')),
 (Decimal('114'), datetime.date(1998, 3, 24), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50')),
 (Decimal('122'), datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50')),
 (Decimal('200'), datetime.date(1987, 9, 17), datetime.date(1993, 6, 17), 'AD_ASST', Decimal('90')),
 (Decimal('176'), datetime.date(1998, 3, 24), datetime.date(1998, 12, 31), 'SA_REP', Decimal('80')),
 (Decimal('176'), datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'SA_MAN', Decimal('80')),
 (Decimal('200'), datetime.date(1994, 7, 1), datetime.date(1998, 12, 31), 'AC_ACCOUNT', Decimal('90')),
 (Decimal('0'), '0000-00-00', '0000-00-00', '', Decimal('0'))]

In [25]:
%%sql
SELECT *
FROM job_history
WHERE START_DATE BETWEEN
'1998-01-01' AND '2000-12-01';

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(Decimal('114'), datetime.date(1998, 3, 24), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50')),
 (Decimal('122'), datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50')),
 (Decimal('176'), datetime.date(1998, 3, 24), datetime.date(1998, 12, 31), 'SA_REP', Decimal('80')),
 (Decimal('176'), datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'SA_MAN', Decimal('80'))]

`NOT BETWEEN` inverts the range:

```mysql
SELECT *
FROM employees
WHERE sales NOT BETWEEN
0 AND target;
```

In [26]:
%%sql
SELECT *
FROM job_history
WHERE start_date NOT BETWEEN
'1990-01-01' AND '2000-12-01';

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(Decimal('101'), datetime.date(1989, 9, 21), datetime.date(1993, 10, 27), 'AC_ACCOUNT', Decimal('110')),
 (Decimal('200'), datetime.date(1987, 9, 17), datetime.date(1993, 6, 17), 'AD_ASST', Decimal('90')),
 (Decimal('0'), '0000-00-00', '0000-00-00', '', Decimal('0'))]

##### <mark>IN</mark>

Checks if a value is in a list of values.
Example:

```mysql
SELECT *
FROM cars
WHERE color
IN ('brown', 'red', 'blue');
```

In [27]:
%%sql 
SELECT *
FROM job_history
WHERE JOB_ID
IN('AC_ACCOUNT','ST_CLERK');

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(Decimal('101'), datetime.date(1989, 9, 21), datetime.date(1993, 10, 27), 'AC_ACCOUNT', Decimal('110')),
 (Decimal('200'), datetime.date(1994, 7, 1), datetime.date(1998, 12, 31), 'AC_ACCOUNT', Decimal('90')),
 (Decimal('114'), datetime.date(1998, 3, 24), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50')),
 (Decimal('122'), datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50'))]

The last query is equivalent to:
```mysql
SELECT *
FROM cars
WHERE color = 'brown' OR color = 'red' OR color = 'blue'; 
```

`NOT` clause inverts the condition.

In [30]:
%%sql 
SELECT *
FROM job_history
WHERE job_id='AC_ACCOUNT' OR job_id='AD_ASST' OR job_id='ST_CLERK';

 * mysql+pymysql://root:***@localhost:3306/newname
5 rows affected.

[(Decimal('101'), datetime.date(1989, 9, 21), datetime.date(1993, 10, 27), 'AC_ACCOUNT', Decimal('110')),
 (Decimal('200'), datetime.date(1994, 7, 1), datetime.date(1998, 12, 31), 'AC_ACCOUNT', Decimal('90')),
 (Decimal('200'), datetime.date(1987, 9, 17), datetime.date(1993, 6, 17), 'AD_ASST', Decimal('90')),
 (Decimal('114'), datetime.date(1998, 3, 24), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50')),
 (Decimal('122'), datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'ST_CLERK', Decimal('50'))]

In [31]:
%%sql 
SELECT *
FROM job_history
WHERE JOB_ID
NOT IN('AC_ACCOUNT','AD_ASST','ST_CLERK');

 * mysql+pymysql://root:***@localhost:3306/newname
6 rows affected.

[(Decimal('0'), '0000-00-00', '0000-00-00', '', Decimal('0')),
 (Decimal('101'), datetime.date(1993, 10, 28), datetime.date(1997, 3, 15), 'AC_MGR', Decimal('110')),
 (Decimal('102'), datetime.date(1993, 1, 13), datetime.date(1998, 7, 24), 'IT_PROG', Decimal('60')),
 (Decimal('201'), datetime.date(1996, 2, 17), datetime.date(1999, 12, 19), 'MK_REP', Decimal('20')),
 (Decimal('176'), datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'SA_MAN', Decimal('80')),
 (Decimal('176'), datetime.date(1998, 3, 24), datetime.date(1998, 12, 31), 'SA_REP', Decimal('80'))]

##### <mark>LIKE</mark>

It helps us find values with wildcards:
- `%`: 0 or more unknown symbols (regular expression equivalent: `.*`).
- `_`: just 1 unknown character (regular expression equivalent: `.{1}`).

|LIKE Operator               |	Description|
|----------------------------|--------------------------------------|
|WHERE CustomerName LIKE 'a%'|	Finds any values that start with "a"|
|WHERE CustomerName LIKE '%a'|	Finds any values that end with "a"|
|WHERE CustomerName LIKE '%or%'|	Finds any values that have "or" in any position|
WHERE CustomerName LIKE '_r%'|	Finds any values that have "r" in the second position|
|WHERE CustomerName LIKE 'a_%'|	Finds any values that start with "a" and are at least 2 characters in length|
|WHERE CustomerName LIKE 'a__%'|	Finds any values that start with "a" and are at least 3 characters in length|
|WHERE ContactName LIKE 'a%o'|	Finds any values that start with "a" and ends with "o"|

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |


```mysql
SELECT *
FROM employees
WHERE emp LIKE "_o%";
/*All the employees who have an "o" in the second character of their name"*/
```

In [32]:
%%sql 
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', None, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

In [165]:
%%sql
SELECT *
FROM employees
WHERE emp LIKE "_o%";

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
2 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None)]

In [36]:
%%sql
SELECT *
FROM employees
WHERE emp LIKE "%e";

 * mysql+pymysql://root:***@localhost:3306/newname
2 rows affected.

[(1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

##### <mark>IS NULL/IS NOT NULL</mark>

In [28]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost:3306/newname
12 rows affected.

[('countries',),
 ('countries2',),
 ('countries3',),
 ('countries4',),
 ('departments',),
 ('employees',),
 ('job_history',),
 ('jobs',),
 ('locations',),
 ('regions',),
 ('users',),
 ('view1',)]

`NULL` indicates that a value is missing or unknown.

```mysql
SELECT *
FROM salesmen
WHERE dept_num IS NULL;
```

In [33]:
%%sql
SELECT *
FROM employees
WHERE dept_id IS NULL;

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(2, 'Bob', None, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None)]

`NOT NULL` gets all the values that are known.
```mysql
SELECT *
FROM salesmen
WHERE sales IS NOT NULL;
```

In [34]:
%%sql
SELECT *
FROM employees
WHERE dept_id IS NOT NULL
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2)]

##### <mark>AND/OR/NOT</mark>

As seen before, they concatenate conditional expressions. A row will be selected if:  
`AND`: The preceding and the next expression, both of them, must be `True`.  
`OR`: One of them is `True`.  
`NOT`: The following expression is `False`.

#### <mark>ORDER BY</mark>

Sorts the query outcome. There may be more than one parameter for considering the order. The default behavior is ascending sort. However, it can be specified by the clause `ASC`. A descending sort is obtained when we use the `DESC` clause.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

In [35]:
%%sql 
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', None, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

```mysql
SELECT emp, salary, contract_date
FROM employees
ORDER BY salary DESC, contract_date DESC;
```

In [38]:
%%sql 
SELECT emp, salary, contract_date
FROM employees
ORDER BY salary DESC, contract_date DESC;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[('Donald', 4000, datetime.datetime(2017, 4, 2, 0, 0)),
 ('Alice', 2000, datetime.datetime(2018, 2, 23, 0, 0)),
 ('Charlie', 2000, datetime.datetime(2016, 10, 27, 0, 0)),
 ('Bob', 1750, datetime.datetime(2000, 8, 19, 0, 0))]

If we want to sort the results using a new calculated column, we should use the `AS` statement:

```mysql
SELECT *, (sales-target) AS newcol
FROM employees
ORDER BY newcol DESC;
```

In [41]:
%%sql 
SELECT *, (sales-target) AS newcol
FROM employees
ORDER BY newcol DESC;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1, 300),
 (0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0, -500),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2, -1500),
 (2, 'Bob', None, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None, None)]

#### <mark>UNION</mark>

Combines 2 or more query results on the same table. There are some restrictions:
- All the queries must have the same number of columns.
- The type of the columns must match.
- None of them should be sorted by the `ORDER BY` clause. However, the outcome after combination can be sorted.

Note that `UNION` drops repeated values, we can keep them using `UNION ALL`.

Examples:

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

In [53]:
%%sql 
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

```mysql
(SELECT emp, sales
FROM employees

WHERE sales>2000)
UNION
(SELECT emp, salary
FROM employees)
UNION 
SELECT "Foo", 1234
ORDER BY 1;
```

In [61]:
%%sql 
(SELECT emp, sales as sales2000
FROM employees
WHERE sales>2000)
UNION
(SELECT emp, salary
FROM employees) 
UNION
SELECT "Foo",1234
ORDER BY 1;

 * mysql+pymysql://root:***@localhost:3306/newname
7 rows affected.

[('Alice', 4300),
 ('Alice', 2000),
 ('Bob', 1750),
 ('Charlie', 2000),
 ('Donald', 5500),
 ('Donald', 4000),
 ('Foo', 1234)]


Notes about the query above:
- The brackets are optional. 
- The column gets, by default, the name of the first table, but here we are mixing sales and salaries; it can be renamed using the `AS` operator. This is possible because sales and salaries are `INTEGER`s.
- We are sorting the final table specifying the column index, not its name. The column index starts at 1.

### Relational algebra: Joins

### Natural join $\bowtie$

> Natural join is a binary operator that is written as (R $\bowtie$ S) where $R$ and $S$ are relations. The result of the natural join is the set of all combinations of tuples in $R$ and $S$ that are equal on their common attribute names. 


> More formally the semantics of the natural join are defined as follows:

> $ R\bowtie S=\left\{r\cup s\ \vert \ r\in R\ \land \ s\in S\ \land \ {\mathit {Fun}}(r\cup s)\right\}$

> where *Fun* is a predicate that is true for a relation t (in the mathematical sense) *iff* t is a function. It is usually required that R and S have at least one common attribute, but if this constraint is omitted, and R and S have no common attributes, then the natural join becomes exactly the Cartesian product.


>As an example consider the tables Employee and Dept and their natural join:


<table align="center">
<tr></tr>
<tr><td>
Employee

| Name    | EmpId | DeptName |
|---------|-------|----------|
| Harry   | 3415  | Finance  |
| Sally   | 2241  | Sales    |
| George  | 3401  | Finance  |
| Harriet | 2202  | Sales    |


</td><td>

</td><td>
Dept

| DeptName   | Manager |
|------------|---------|
| Finance    | George  |
| Sales      | Harriet |
| Production | Charles |

</td></tr>
</table>


> <center>$Employee \bowtie Dept$</center>

> | Name    | EmpId | DeptName | Manager |
|---------|-------|----------|---------|
| Harry   | 3415  | Finance  | George  |
| Sally   | 2241  | Sales    | Harriet |
| George  | 3401  | Finance  | George  |
| Harriet | 2202  | Sales    | Harriet |

###  θ-join and equijoin

> Consider tables *Car* and *Boat* which list models of cars and boats and their respective prices. Suppose a customer wants to buy a car and a boat, but she does not want to spend more money on the boat than on the car. The θ-join (⋈θ) on the predicate $CarPrice ≥ BoatPrice$ produces the flattened pairs of rows which satisfy the predicate. When using a condition where the attributes are equal, such as Price, then the condition may be specified as $Price=Price$ or alternatively (Price) itself.


<table align="center">
<tr></tr>
<tr><td>
Car
    
| CarModel | CarPrice |
|----------|----------|
| CarA     | 20000    |
| CarB     | 30000    |
| CarC     | 50000    |

</td><td>
    
</td><td>
Boat
    
| BoatModel | BoatPrice |
|-----------|-----------|
| Boat1     | 10000     |
| Boat2     | 40000     |
| Boat3     | 60000     |

</td></tr>
</table>

> <center>$Car \bowtie Boat$ </center>  
> <center>$CarPrice \ge BoatPrice$ </center> 

>| CarModel | CarPrice | BoatModel | BoatPrice |
|----------|----------|-----------|-----------|
| CarA     | 20000    | Boat1     | 10000     |
| CarB     | 30000    | Boat1     | 10000     |
| CarC     | 50000    | Boat1     | 10000     |
| CarC     | 50000    | Boat2     | 40000     |

> If we want to combine tuples from two relations where the combination condition is not simply the equality of shared attributes then it is convenient to have a more general form of join operator, which is the $\theta$-join (or theta-join). The $\theta$-join is a binary operator that is written as ${R\ \bowtie\ S \atop a\ \theta\ b}$ or ${R\ \bowtie\ S \atop a\ \theta\ v}$ where $a$ and $b$ are attribute names, $\theta$ is a binary relational operator in the set {&lt;, ≤, =, ≠, &gt;, ≥}, $v$ is a value constant, and $R$ and $S$ are relations.  The result of this operation consists of all combinations of tuples in $R$ and $S$ that satisfy $\theta$.  The result of the $\theta$-join is defined only if the headers of $S$ and $R$ are disjoint, that is, do not contain a common attribute.

> The simulation of this operation in the fundamental operations is therefore as follows:  
$R  \bowtie_\theta S = \sigma_\theta(R \times S)$

> In case the operator $\theta$ is the equality operator (=) then this join is also called an **equijoin**.

### Semijoin ($\ltimes$, $\rtimes$)

> The left semijoin is a joining similar to the natural join and written as $R \ltimes S$ where $R$ and $S$ are relations. The result is the set of all tuples in $R$ for which there is a tuple in $S$ that is equal on their common attribute names. The difference from a natural join is that other columns of $S$ do not appear. For example, consider the tables *Employee* and *Dept* and their semijoin:


<table align="center">
<tr></tr>
<tr><td>
Employee

| Name    | EmpId | DeptName   |
|---------|-------|------------|
| Harry   | 3415  | Finance    |
| Sally   | 2241  | Sales      |
| George  | 3401  | Finance    |
| Harriet | 2202  | Production |

</td><td>

</td><td>
Dept

| DeptName   | Manager |
|------------|---------|
| Sales      | Sally   |
| Production | Harriet |

</td></tr>
</table>


> <center>$Employee \ltimes Dept$</center>

> | Name    | EmpId | DeptName   |
|---------|-------|------------|
| Sally   | 2241  | Sales      |
| Harriet | 2202  | Production |

>More formally the semantics of the semijoin can be defined as follows:

> $R \ltimes S = \{ t:t \in R \land \exists s \in S(Fun (t \cup s)) \}$

> where $Fun(r)$ is as in the definition of natural join.

> The semijoin can be simulated using the natural join as follows. If $a_1, ..., a_n$ are the attribute names of $R$, then
$R \ltimes S = \pi_{a_1,...,a_n}(R \bowtie S)$.
Since we can simulate the natural join with the basic operators it follows that this also holds for the semijoin.
In Codd's 1970 paper, semijoin is called restriction.

### Antijoin $\triangleright$

> The antijoin, written as $R \triangleright S$ where R and S are relations, is similar to the semijoin, but the result of an antijoin is only those tuples in R for which there is no tuple in S that is equal on their common attribute names.

> For an example consider the tables Employee and Dept and their antijoin:

<table align="center">
<tr></tr>
<tr><td>
Employee
    
| Name    | EmpId | DeptName   |
|---------|-------|------------|
| Harry   | 3415  | Finance    |
| Sally   | 2241  | Sales      |
| George  | 3401  | Finance    |
| Harriet | 2202  | Production |

</td><td>

</td><td>
Dept
    
| DeptName   | Manager |
|------------|---------|
| Sales      | Sally   |
| Production | Harriet |

</td></tr>
</table>


> <center>$Employee \triangleright Dept$</center>

| Name   | EmpId | DeptName |
|--------|-------|----------|
| Harry  | 3415  | Finance  |
| George | 3401  | Finance  |

> The antijoin is formally defined as follows:

> $R \triangleright S = { t : t \in R \land \lnot \exists \in S(Fun(t \cup s)) }$

> or

> $R \triangleright S = \{ t : t \in  R$, there is no tuple $s$ of $S$ that satisfies $Fun (t \cup  s) \}$

> where $Fun (t \cup  s)$ is as in the definition of natural join.

> The antijoin can also be defined as the complement of the semijoin, as follows:
$R \triangleright S = R - R \ltimes S$
Given this, the antijoin is sometimes called the anti-semijoin, and the antijoin operator is sometimes written as semijoin symbol with a bar above it, instead of $\triangleright$.

###  Division $\div$

> The division is a binary operation that is written as $R \div S$. Division is not implemented directly in SQL. The result consists of the restrictions of tuples in $R$ to the attribute names unique to $R$, i.e., in the header of $R$ but not in the header of $S$, for which it holds that all their combinations with tuples in $S$ are present in $R$. As an example have a look at the tables *Completed*, *DBProject* and their division:

<table align="center">
<tr></tr>
<tr><td>
Completed

| Student | Task      |
|---------|-----------|
| Fred    | Database1 |
| Fred    | Database2 |
| Fred    | Compiler1 |
| Eugene  | Database1 |
| Eugene  | Compiler1 |
| Sarah   | Database1 |
| Sarah   | Database2 |

</td><td>

</td><td>
DBProject

| Task      |
|-----------|
| Database1 |
| Database2 |

</td></tr>
</table>

> <center>$Completed \div DBProject$</center>

| Student |
|---------|
| Fred    |
| Sarah   |

> If *DBProject* contains all the tasks of the Database project, then the result of the division above contains exactly the students who have completed both of the tasks in the Database project.

> More formally the semantics of the division is defined as follows: $R \div S = \{ t[a_1,...,a_n] : t \in R \land \forall s \in S ( (t[a_1,...,a_n] \cup s) \in R) \}$ where $\{a_1,...,a_n\}$ is the set of attribute names unique to R and $t[a_1,...,a_n]$ is the restriction of $t$ to this set. It is usually required that the attribute names in the header of $S$ are a subset of those of $R$ because otherwise the result of the operation will always be empty.

> The simulation of the division with the basic operations is as follows. We assume that $a_1,...,a_n$ are the attribute names unique to $R$ and $b_1,...,b_m$ are the attribute names of $S$. In the first step we project $R$ on its unique attribute names and construct all combinations with tuples in $S$:

> $T := \pi_{a_1,...,a_n}(R) \times S$

> In the prior example, $T$ would represent a table such that every Student (because Student is the unique key / attribute of the Completed table) is combined with every given Task. So Eugene, for instance, would have two rows, Eugene $\to$ Database1 and Eugene $\to$ Database2 in $T$.

### Outer joins

> Whereas the result of a join (or inner join) consists of tuples formed by combining matching tuples in the two operands, an outer join contains those tuples and additionally some tuples formed by extending an unmatched tuple in one of the operands by "fill" values for each of the attributes of the other operand. Outer joins are not considered part of the classical relational algebra discussed so far.

> The operators defined in this section assume the existence of a null value, $\omega$, which we do not define, to be used for the fill values; in practice this corresponds to the `NULL` in `SQL`. In order to make subsequent selection operations on the resulting table meaningful, a semantic meaning needs to be assigned to nulls; in Codd's approach the propositional logic used by the selection is extended to a three-valued logic, although we elide those details in this article.

> Three outer join operators are defined: left outer join, right outer join, and full outer join. (The word "outer" is sometimes omitted.)

#### Left outer join

> The left outer join is written as R ⟕ S where R and S are relations. The result of the left outer join is the set of all combinations of tuples in R and S that are equal on their common attribute names, in addition (loosely speaking) to tuples in R that have no matching tuples in S.

> For an example consider the tables Employee and Dept and their left outer join:

<table align="center">
<tr></tr>
<tr><td>
Employee
    
| Name    | EmpId | DeptName  |
|---------|-------|-----------|
| Harry   | 3415  | Finance   |
| Sally   | 2241  | Sales     |
| George  | 3401  | Finance   |
| Harriet | 2202  | Sales     |
| Tim     | 1123  | Executive |


</td><td>

</td><td>
Dept
    
| DeptName   | Manager |
|------------|---------|
| Sales      | Harriet |
| Production | Charles |


</td></tr>
</table>   
    

> **<center>Employee ⟕ Dept</center>**

| Name    | EmpId | DeptName  | Manager |
|---------|-------|-----------|---------|
| Harry   | 3415  | Finance   | $\omega$  |
| Sally   | 2241  | Sales     | Harriet |
| George  | 3401  | Finance   | $\omega$  |
| Harriet | 2202  | Sales     | Harriet |
| Tim     | 1123  | Executive | $\omega$  |

>In the resulting relation, tuples in $S$ which have no common values in common attribute names with tuples in $R$ take a `NULL` value, $\omega$.

>Since there are no tuples in *Dept* with a *DeptName* of *Finance* or *Executive*, NULLs occur in the resulting relation where tuples in *Employee* have a *DeptName* of *Finance* or *Executive*.

>Let $r_1, r_2, ..., r_n$ be the attributes of the relation $R$ and let $\{(\omega, ..., \omega)\}$ be the singleton relation on the attributes that are unique to the relation $S$ (those that are not attributes of $R$). Then the left outer join can be described in terms of the natural join (and hence using basic operators) as follows: $(R \bowtie S) \cup ((R - \pi_{r_1, r_2, \dots, r_n}(R \bowtie S)) \times \{(\omega, \dots \omega)\})$

#### Right outer join ⟖

> The right outer join behaves almost identically to the left outer join, but the roles of the tables are switched.

> The right outer join of relations R and S is written as $R$ ⟖ $S$. The result of the right outer join is the set of all combinations of tuples in $R$ and $S$ that are equal on their common attribute names, in addition to tuples in $S$ that have no matching tuples in $R$.

> For example, consider the tables Employee and Dept and their right outer join:

<table align="center">
<tr></tr>
<tr><td>
Employee
    
| Name    | EmpId | DeptName  |
|---------|-------|-----------|
| Harry   | 3415  | Finance   |
| Sally   | 2241  | Sales     |
| George  | 3401  | Finance   |
| Harriet | 2202  | Sales     |
| Tim     | 1123  | Executive |


</td><td>

</td><td>
Dept
    
| DeptName   | Manager |
|------------|---------|
| Sales      | Harriet |
| Production | Charles |


</td></tr>
</table>   
    

> **<center>Employee ⟖ Dept</center>**

| Name    | EmpId  | DeptName   | Manager |
|---------|--------|------------|---------|
| Sally   | 2241   | Sales      | Harriet |
| Harriet | 2202   | Sales      | Harriet |
| $\omega$  | $\omega$ | Production | Charles |

> In the resulting relation, tuples in $R$ which have no common values in common attribute names with tuples in $S$ take a `NULL` value. $\omega$.

> Since there are no tuples in *Employee* with a *DeptName* of Production, NULLs occur in the *Name* and *EmpId* attributes of the resulting relation where tuples in *Dept* had *DeptName* of *Production*.

> Let $s1, s2, ..., sn$ be the attributes of the relation S and let $\{(\omega, ..., \omega)\}$ be the singleton relation on the attributes that are *unique* to the relation $R$ (those that are not attributes of $S$). Then, as with the left outer join, the right outer join can be simulated using the natural join as follows:
$(R \bowtie S) \cup (\{(\omega, \dots, \omega)\} \times (S - \pi_{s_1, s_2, \dots, s_n}(R \bowtie S)))$

#### Full outer join ⟗

> The **outer join** or **full outer join** in effect combines the results of the left and right outer joins.

> The full outer join is written as $R$ ⟗ $S$ where $R$ and $S$ are relations. The result of the full outer join is the set of all combinations of tuples in $R$ and $S$ that are equal on their common attribute names, in addition to tuples in $S$ that have no matching tuples in $R$ and tuples in $R$ that have no matching tuples in $S$ in their common attribute names.

> For an example consider the tables *Employee* and *Dept* and their full outer join:

<table align="center">
<tr></tr>
<tr><td>
Employee
    
| Name    | EmpId | DeptName  |
|---------|-------|-----------|
| Harry   | 3415  | Finance   |
| Sally   | 2241  | Sales     |
| George  | 3401  | Finance   |
| Harriet | 2202  | Sales     |
| Tim     | 1123  | Executive |


</td><td>

</td><td>
Dept
    
| DeptName   | Manager |
|------------|---------|
| Sales      | Harriet |
| Production | Charles |


</td></tr>
</table>   
    

> **<center>Employee ⟗ Dept</center>**

| Name    | EmpId  | DeptName   | Manager |
|---------|--------|------------|---------|
| Harry   | 3415   | Finance    | $\omega$  |
| Sally   | 2241   | Sales      | Harriet |
| George  | 3401   | Finance    | $\omega$  |
| Harriet | 2202   | Sales      | Harriet |
| Tim     | 1123   | Executive  | $\omega$  |
| $\omega$  | $\omega$ | Production | Charles |

> In the resulting relation, tuples in $R$ which have no common values in common attribute names with tuples in $S$ take a null value, $\omega$.

> Since there are no tuples in Employee with a *DeptName* of *Production*, $\omega$s occur in the *Name* and *EmpId* attributes of the resulting relation where tuples in *Dept* had *DeptName* of *Production*.

> Let $s_1, s_2, ..., s_n$ be the attributes of the relation $S$ and let $\{(\omega, ..., \omega)\}$ be the singleton relation on the attributes that are unique to the relation $R$ (those that are not attributes of $S$). Then, as with the left outer join, the right outer join can be simulated using the natural join as follows: $(R \bowtie S) \cup (\{(\omega, \dots, \omega)\} \times (S - \pi_{s_1, s_2, \dots, s_n}(R \bowtie S)))$

### <mark>Multitable queries</mark>

#### Different Types of SQL JOINs
Here are the different types of the JOINs in SQL:

1. (INNER) JOIN: Returns records that have matching values in both tables
2. LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table
3. RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
4. FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table

![alt img](img/typesjoin.png "Types Join")

##### <mark>Inner join</mark>

The rows are combined if the condition is true. Therefore, NULL values are excluded.

<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>

```mysql
SELECT * 
FROM employees, departments 
WHERE employees.dept_id=departments.id;
```

In [64]:
%%sql 
SELECT *
FROM employees, departments
WHERE employees.dept_id=departments.id;

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0, 0, 'main_office', 'London', '+44 314159265', 5000),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1, 1, 'marketing', 'Paris', '+33358979323', 1750),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2, 2, 'sales', 'Madrid', '+34 846-264-338', 2000)]

Or

```mysql
SELECT * 
FROM
employees JOIN departments 
ON employees.dept_id=departments.id;
```

In [65]:
%%sql
SELECT * 
FROM 
employees JOIN departments 
ON employees.dept_id=departments.id;

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0, 0, 'main_office', 'London', '+44 314159265', 5000),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2, 2, 'sales', 'Madrid', '+34 846-264-338', 2000),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1, 1, 'marketing', 'Paris', '+33358979323', 1750)]

##### <mark>Outer join</mark>

There are 2 possibilities:
- Include all the values from the first table and if the join condition is met, combine the data from the first table with the second table. Otherwise, combine them with `NULL` values.

- Include all the values from the second table and if the join condition is met, combine the data from the first table with the second table. Otherwise, combine them with `NULL` values.

<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>


```mysql
SELECT * 
FROM employees 
LEFT JOIN departments 
ON employees.dept_id = departments.id;
```

| emp_id | emp     | sales | target | salary | contract_date | dept_id | id   | name         | city   | phone           | rent |
|--------|---------|-------|--------|--------|---------------|---------|------|--------------|--------|-----------------|------|
| 0      | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       | 0    | main_office  | London | +44 314159265   | 5000 |
| 1      | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       | 2    | sales        | Madrid | +34 846-264-338 | 2000 |
| 2      | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    | NULL | NULL         | NULL   | NULL            | NULL |
| 3      | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       | 1    | marketing    | Paris  | +33358979323    | 1750 |


___


<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |


</td></tr>
</table>



```mysql
SELECT * 
FROM employees 
RIGHT JOIN departments 
ON employees.dept_id = departments.id;
```

| emp_id | emp     | sales | target | salary | contract_date | dept_id | id | name        | city   | phone           | rent |
|--------|---------|-------|--------|--------|---------------|---------|----|-------------|--------|-----------------|------|
| 0      | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       | 0  | main_office | London | +44 314159265   | 5000 |
| 3      | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       | 1  | marketing   | Paris  | +33358979323    | 1750 |
| 1      | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       | 2  | sales       | Madrid | +34 846-264-338 | 2000 |
| NULL   | NULL    | NULL  | NULL   | NULL   | NULL          | NULL    | 3  | sales       | Berlin | 00493279502884  | 1900 |

#### FULL OUTER JOIN

```mysql
SELECT column_name(s)
FROM table1
FULL OUTER JOIN table2
ON table1.column_name = table2.column_name
WHERE condition;
```

In [70]:
%%sql
SELECT * 
FROM employees
#FULL OUTER JOIN JOIN departments 
#ON employees.dept_id = departments.id;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

In [73]:
%%sql
SELECT * 
FROM departments

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'main_office', 'London', '+44 314159265', 5000),
 (1, 'marketing', 'Paris', '+33358979323', 1750),
 (2, 'sales', 'Madrid', '+34 846-264-338', 2000),
 (3, 'sales', 'Berlin', '00493279502884', 1900)]

In [75]:
%%sql
SELECT * 
FROM employees
#FULL OUTER JOIN departments ya no jala
ON employees.dept_id = departments.id;

# UNION en su lugar

 * mysql+pymysql://root:***@localhost:3306/newname
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'ON employees.dept_id = departments.id' at line 4")
[SQL: SELECT *
FROM employees
#FULL OUTER JOIN departments ya no jala
ON employees.dept_id = departments.id;]
(Background on this error at: http://sqlalche.me/e/13/f405)

### Relational algebra: Operations for domain computations

#### Aggregation

> Furthermore, computing various functions on a column, like the summing up of its elements, is also not possible using the relational algebra introduced so far. There are five aggregate functions that are included with most relational database systems. These operations are *Sum, Count, Average, Maximum and Minimum*. In relational algebra the aggregation operation over a schema $(A_1, A_2, ... A_n)$ is written as follows: $G_1,G_2,\ldots ,G_m g_{f_{1}({A_{1}}'),f_{2}({A_{2}}'),\ldots ,f_{k}({A_{k}}')}\ (r)$

> where each $A'_j, 1 ≤ j ≤ k$, is one of the original attributes $A_i, 1 ≤ i ≤ n$.

> The attributes preceding the g are grouping attributes, which function like a "group by" clause in SQL. Then there are an arbitrary number of aggregation functions applied to individual attributes. The operation is applied to an arbitrary relation *r*. The grouping attributes are optional, and if they are not supplied, the aggregation functions are applied across the entire relation to which the operation is applied.

### <mark>Aggregated functions</mark>

#### <mark>SUM</mark>

Takes the name of a column as an argument and returns the sum of all the values in that column.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |


```mysql
SELECT SUM(sales)
FROM employees;
```

In [76]:
%%sql
SELECT SUM(sales)
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(Decimal('13300'),)]

#### <mark>AVG</mark>

Returns the average value for a numeric column.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

```mysql
SELECT AVG(salary)
FROM employees;
```

In [78]:
%%sql
SELECT AVG(sales), SUM(salary)
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(Decimal('3325.0000'), Decimal('9750'))]

#### <mark>MIN/MAX</mark>

-`MIN` Returns the smallest value in that column.

-`MAX` Returns the largest value in that column.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

```mysql
SELECT MIN(emp)
FROM employees;
```

| MIN(emp) |
|----------|
| Alice    |

```mysql
SELECT MAX(contract_date)
FROM employees;
```

| MAX(contract_date) |
|--------------------|
| 2018-02-23         |

#### <mark>COUNT</mark>

Takes the name of a column as an argument and counts the number of rows where the column is not `NULL`. The column used to count the rows does not matter.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |


```mysql
SELECT COUNT(*) 
FROM employees;
```

| COUNT($*$) |
|------------|
| 4          |

In [206]:
%%sql
SELECT COUNT(*)
FROM employees;

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
1 rows affected.

[(4,)]

#### <mark>More on aggregated functions</mark>

- Aggregated functions may appear in any place that a column name shows up. 
- Aggregated functions cannot contain another aggregated function.
- `NULL` values are ignored.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

```mysql
SELECT COUNT(*) AS Nemp, SUM(sales), AVG(salary), MIN(contract_date) 
FROM employees;
```

| Nemp | SUM(target-sales) | AVG(salary) | MIN(contract_date) |
|------|-------------------|-------------|--------------------|
| 4    | 1700              | 2437.5000   | 2000-08-19         |

#### <mark>DISTINCT</mark>

They may also occur on an aggregated function.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |


```mysql
SELECT COUNT(DISTINCT(salary))
FROM employees;
```

| COUNT(DISTINCT(salary)) |
|-------------------------|
| 3                       |

In [79]:
%%sql
SELECT COUNT(DISTINCT(salary))
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(3,)]

In [214]:
%%sql
SELECT COUNT(DISTINCT(salary))
FROM employees;

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
1 rows affected.

[(3,)]

#### <mark>GROUP BY</mark>

It is only used with aggregated functions. It is used in collaboration with the `SELECT` statement to arrange identical data into groups. 

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

```mysql
SELECT salary, COUNT(*)
FROM employees
GROUP BY salary;
```

| salary | COUNT($*$) |
|--------|------------|
| 2000   | 2          |
| 1750   | 1          |
| 4000   | 1          |

In [215]:
%%sql
SELECT salary, COUNT(*)
FROM employees
GROUP BY salary;

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
3 rows affected.

[(4000, 1), (2000, 2), (1750, 1)]

#### <mark>HAVING</mark>

Similar to `WHERE` clause; it's used with aggregated functions.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

```mysql
SELECT salary, COUNT(*) AS amount
FROM employees
GROUP BY salary
HAVING amount>1;
```

| salary | COUNT($*$) |
|--------|------------|
| 2000   | 2          |

In [80]:
%%sql
SELECT salary, COUNT(*) AS amount
FROM employees
GROUP BY salary
HAVING amount>1;

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(2000, 2)]

### <mark>Subqueries and nested subqueries</mark>

SQL allows us to perform a query in a subquery. It's pretty similar to the natural language. It's a powerful technique since we can decompose a query in smaller chunks.

A subquery is a query that appears in another query after its `WHERE` or `HAVING` clause. That's why:

- The result of the subquery must be just a column of values.

- `ORDER BY` cannot be placed in a subquery since the result of the subquery is hidden to the user.

- A subquery cannot be the `UNION` of different queries.

#### <mark>WHERE</mark>

<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>


```mysql
SELECT name as office
FROM departments
WHERE rent<
(SELECT AVG(sales)
FROM employees
WHERE dept_id=id);
```

In [82]:
#Obtiene el promedio de cada dept_id y 
#lo compara con la renta, si renta<sales, muestra el departamento
%%sql
SELECT name as office
FROM departments
WHERE rent<
(SELECT AVG(sales)
FROM employees
WHERE dept_id=id);

 * mysql+pymysql://root:***@localhost:3306/newname
2 rows affected.

[('main_office',), ('marketing',)]

In [104]:
%%sql
SELECT dept_id,AVG(sales)
FROM employees
GROUP BY dept_id;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(None, Decimal('2000.0000')),
 (0, Decimal('5500.0000')),
 (1, Decimal('4300.0000')),
 (2, Decimal('1500.0000'))]

In [103]:
%%sql
SELECT *
FROM departments

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'main_office', 'London', '+44 314159265', 5000),
 (1, 'marketing', 'Paris', '+33358979323', 1750),
 (2, 'sales', 'Madrid', '+34 846-264-338', 2000),
 (3, 'sales', 'Berlin', '00493279502884', 1900)]

#### <mark>IN</mark>

<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>


```mysql
SELECT emp
FROM employees
WHERE dept_id
IN(SELECT id
FROM departments
WHERE name="sales");
```

| emp     |
|---------|
| Charlie |

In [225]:
%%sql
SELECT id
FROM departments
WHERE name="sales"

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
2 rows affected.

[(2,), (3,)]

In [227]:
%%sql
SELECT emp
FROM employees
#WHERE dept_id

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
4 rows affected.

[('Donald',), ('Charlie',), ('Bob',), ('Alice',)]

In [228]:
%%sql
SELECT emp
FROM employees
WHERE dept_id
IN(SELECT id
FROM departments
WHERE name="sales");

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
1 rows affected.

[('Charlie',)]

#### <mark>EXISTS</mark>

`EXISTS` can only be used in subqueries. Returns `True` if the subquery has any row; `False` otherwise. `EXISTS` can be used with subqueries that return more than 1 column.

<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>


```mysql
SELECT city, phone
FROM departments
WHERE EXISTS
(SELECT * 
FROM departments
WHERE rent>(SELECT AVG(rent) FROM departments));
/* This is a nested subquery! */
```

| city   | phone           |
|--------|-----------------|
| London | +44 314159265   |
| Paris  | +33358979323    |
| Madrid | +34 846-264-338 |
| Berlin | 00493279502884  |

In [102]:
%%sql
SELECT city, phone
FROM departments
WHERE EXISTS
(SELECT * 
FROM departments
WHERE rent>(SELECT AVG(rent) FROM departments));

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[('London', '+44 314159265'),
 ('Paris', '+33358979323'),
 ('Madrid', '+34 846-264-338'),
 ('Berlin', '00493279502884')]

In [91]:
%%sql
SELECT AVG(rent) FROM departments

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(Decimal('2662.5000'),)]

In [105]:
%%sql
SELECT *
FROM departments

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'main_office', 'London', '+44 314159265', 5000),
 (1, 'marketing', 'Paris', '+33358979323', 1750),
 (2, 'sales', 'Madrid', '+34 846-264-338', 2000),
 (3, 'sales', 'Berlin', '00493279502884', 1900)]

In [109]:
%%sql
SELECT * 
FROM departments
WHERE rent>(SELECT AVG(rent) FROM departments);
#Exist Returns True if the subquery has any row; False otherwise. 
#como existe almentos una, es decir será true nos regresará todas las filas

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(0, 'main_office', 'London', '+44 314159265', 5000)]

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(0, 'main_office', 'London', '+44 314159265', 5000)]

#### <mark>ANY/SOME/ALL</mark>

The ANY and ALL operators are used with a WHERE or HAVING clause.

The ANY operator returns true if any of the subquery values meet the condition.

The ALL operator returns true if all of the subquery values meet the condition.
The `ANY` and `SOME` clauses are equivalent.

<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>


```mysql
SELECT emp, salary
FROM employees
WHERE salary > ANY (SELECT rent 
FROM departments);
```

In [111]:
%%sql
SELECT rent 
FROM departments

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(5000,), (1750,), (2000,), (1900,)]

In [110]:
%%sql
SELECT emp, salary
FROM employees
WHERE salary > ANY (SELECT rent 
FROM departments);

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[('Donald', 4000), ('Charlie', 2000), ('Alice', 2000)]

| emp     | salary |
|---------|--------|
| Donald  | 4000   |
| Charlie | 2000   |
| Alice   | 2000   |

___


<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>


```mysql
SELECT emp, salary
FROM employees
WHERE salary > ALL (SELECT rent 
FROM departments 
WHERE id=dept_id);
```

| emp   | salary |
|-------|--------|
| Bob   | 1750   |
| Alice | 2000   |

In [112]:
%%sql
SELECT emp, salary
FROM employees
WHERE salary > ALL (SELECT rent 
FROM departments 
WHERE id=dept_id);

 * mysql+pymysql://root:***@localhost:3306/newname
2 rows affected.

[('Bob', 1750), ('Alice', 2000)]

In [118]:
%%sql
SELECT rent 
FROM departments, employees 
WHERE id=employees.dept_id;

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(0, 'main_office', 'London', '+44 314159265', 5000, 0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'marketing', 'Paris', '+33358979323', 1750, 3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1),
 (2, 'sales', 'Madrid', '+34 846-264-338', 2000, 1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2)]

In [ ]:
%%sql
SELECT emp, salary
FROM employees
WHERE salary > A (SELECT rent 
FROM departments 
WHERE id=dept_id);

#### <mark>HAVING</mark>

<table align="center">
<tr></tr>
<tr><td>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |

</td><td>

</td><td>
    
**<center>departments</center>**    

| <u>id</u> | name        | city   | phone           | rent |
|-----------|-------------|--------|-----------------|------|
| 0         | main_office | London | +44 314159265   | 5000 |
| 1         | marketing   | Paris  | +33358979323    | 1750 |
| 2         | sales       | Madrid | +34 846-264-338 | 2000 |
| 3         | sales       | Berlin | 00493279502884  | 1900 |

</td></tr>
</table>


```mysql
SELECT city, AVG(rent)
FROM employees, departments
WHERE id=dept_id 
GROUP BY city 
HAVING AVG(rent) < (SELECT MAX(sales) FROM employees);
```

| city   | avg(rent) |
|--------|-----------|
| London | 5000.0000 |
| Paris  | 1750.0000 |
| Madrid | 2000.0000 |

In [119]:
%%sql
SELECT MAX(sales) FROM employees

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(5500,)]

In [121]:
%%sql
SELECT AVG(rent)
FROM departments;

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[(Decimal('2662.5000'),)]

In [130]:
%%sql
SELECT *
FROM employees, departments
WHERE id=dept_id

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0, 0, 'main_office', 'London', '+44 314159265', 5000),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2, 2, 'sales', 'Madrid', '+34 846-264-338', 2000),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1, 1, 'marketing', 'Paris', '+33358979323', 1750)]

In [131]:
%%sql
SELECT city, AVG(rent)
FROM employees, departments
WHERE id=dept_id 
GROUP BY city 
HAVING AVG(rent) < (SELECT MAX(sales) FROM employees);

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[('London', Decimal('5000.0000')),
 ('Paris', Decimal('1750.0000')),
 ('Madrid', Decimal('2000.0000'))]

#### <mark>WITH</mark>

Special case of a subquery. It stores the result of a query in a temporary table using an alias. It's also possible to define multiple temporary tables.

The `WITH` clause is also known as *common table expression* (CTE) and subquery factoring.

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |


```mysql
WITH money (s1, s2) AS
(SELECT salary AS s2, sales AS s1 
 FROM employees) 
SELECT AVG(s1), MIN(s2) 
FROM money;
```

| AVG(s1)   | MIN(s2) |
|-----------|---------|
| 2437.5000 | 1500    |

In [237]:
%%sql
WITH money (s1, s2) AS
(SELECT salary AS s2, sales AS s1 
 FROM employees) 
SELECT AVG(s1), MIN(s2) 
FROM money;

   mysql+pymysql://root:***@localhost:3306/db
 * mysql+pymysql://root:***@localhost:3306/world
1 rows affected.

[(Decimal('2437.5000'), 1500)]

### -------> EXERCISES 
Open Notebook Exercises

### <mark>Data modifications</mark>

- `INSERT`: adds new rows.
- `DELETE`: deletes rows.
- `UPDATE`: modifies existing data.

#### <mark>INSERT INTO</mark>

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |


```mysql
INSERT INTO employees(contract_date, emp, target, salary, emp_id, dept_id)
VALUES(CURDATE(), "Eleanor", 1500, 1000, 27, NULL);
```
or
```mysql
INSERT INTO employees
VALUES(27, "Eleanor", NULL, 1500, 1000, CURDATE(), 0);
```

```mysql
INSERT INTO table_name (column_list)
VALUES
    (value_list_1),
    (value_list_2),
    ...
    (value_list_n);
```

In [9]:
%%sql
INSERT INTO employees(contract_date, emp, target, salary, emp_id, dept_id)
VALUES(CURDATE(), "Eleanor", 1500, 1000, 27, NULL);

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[]

In [10]:
%%sql
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
5 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1),
 (27, 'Eleanor', None, 1500, 1000, datetime.datetime(2021, 1, 13, 0, 0), None)]

In [11]:
%%sql
INSERT INTO employees
VALUES(28, "Eleanor", NULL, 1500, 1000, CURDATE(), 0);

 * mysql+pymysql://root:***@localhost:3306/newname
1 rows affected.

[]

In [12]:
%%sql 
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
6 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1),
 (27, 'Eleanor', None, 1500, 1000, datetime.datetime(2021, 1, 13, 0, 0), None),
 (28, 'Eleanor', None, 1500, 1000, datetime.datetime(2021, 1, 13, 0, 0), 0)]

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 27            | Eleanor | NULL  | 1500   | 1000   | 2019-04-18    | NULL    |

#### <mark>UPDATE...SET</mark>

**<center>employees</center>**

| emp     | sales | target | salary | contract_date |
|---------|-------|--------|--------|---------------|
| Alice   | 4300  | 4000   | 2000   | 23/02/2018    |
| Bob     | 2000  | 2000   | 1750   | 19/08/2000    |
| Charlie | 1500  | 3000   | 2000   | 27/10/2016    |
| Donald  | 5500  | 6000   | 4000   | 02/04/2017    |
| Eleanor | NULL  | 1500   | 1000   | 15/04/2019    |


```mysql
UPDATE employees
SET sales=2 
WHERE emp="Eleanor";
/* MySQL sometimes requires you to either use a KEY column to update a row or to disable that protection by executing "SET sql_safe_updates=0;" */
```

In [13]:
%%sql
UPDATE employees
SET sales=2 
WHERE emp="Eleanor";

 * mysql+pymysql://root:***@localhost:3306/newname
2 rows affected.

[]

In [14]:
%%sql
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
6 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1),
 (27, 'Eleanor', 2, 1500, 1000, datetime.datetime(2021, 1, 13, 0, 0), None),
 (28, 'Eleanor', 2, 1500, 1000, datetime.datetime(2021, 1, 13, 0, 0), 0)]

**<center>employees</center>**

| <u>emp_id</u> | emp     | sales | target | salary | contract_date | dept_id |
|---------------|---------|-------|--------|--------|---------------|---------|
| 0             | Donald  | 5500  | 6000   | 4000   | 2017-04-02    | 0       |
| 1             | Charlie | 1500  | 3000   | 2000   | 2016-10-27    | 2       |
| 2             | Bob     | 2000  | 2000   | 1750   | 2000-08-19    | NULL    |
| 3             | Alice   | 4300  | 4000   | 2000   | 2018-02-23    | 1       |
| 27            | Eleanor | 2     | 1500   | 1000   | 2019-04-18    | NULL    |

#### <mark>DELETE FROM</mark>

```mysql
DELETE FROM employees WHERE emp = 'Eleanor';
/* MySQL sometimes requires you to either use a KEY column to delete a row or to disable that protection by executing "SET sql_safe_updates=0;" */
```

In [15]:
%%sql
DELETE FROM employees WHERE emp = 'Eleanor';

 * mysql+pymysql://root:***@localhost:3306/newname
2 rows affected.

[]

In [16]:
%%sql
SELECT * FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

![alt text](img/r_983642_3ccVk.jpg "Don't forget the WHERE statement!")

[[Source]](https://devrant.com/rants/983642/where-clause)

**SQL** es un lenguaje estándar tanto de ANSI como de ISO, organizaciones que se ocupan de supervisar el desarrollo de estándares para productos, servicios, sistemas, etc. a fin de facilitar los procesos.

Este lenguaje SQL estándar fue tomado por la mayoría de empresas desarrolladores de bases de datos e incluido en sus productos, tales como Microsoft, Oracle, MySQL, IBM, etc.

Posteriormente, **estas empresas decidieron ampliar este SQL estándar con características propias para sus bases de datos, es así que Microsoft desarrolló el Transact-SQL, Oracle el PL-SQL y así cada una de estas empresas.**

Teniendo en cuenta estas premisas, respondamos entonces algunas preguntas subyacentes:

 

¿Son distintos SQL y Transact-SQL? 
La realidad es que Transact-SQL es una variante mejorada del SQL estándar, es decir, tiene las características del SQL y a su vez se le agregaron otras posibilidades sobre todo para lo que es la programación de Stored Procedures y Triggers.

#Transact-SQL
BEGIN TRY
BEGIN TRANSACTION:
    
--INSERT INTO  
-- code to try 
COMMIT TRANSACTION;

END TRY  

BEGIN CATCH  
---ERRORS

--code to run if error occurs
--is generated in try
ROLLBACK TRANSACTION; 

END CATCH

#-------------

BEGIN TRANSACTION:
    
--INSERT INTO  
-- code to try 
COMMIT TRANSACTION;

ROLLBACK TRANSACTION;

### <mark>Databases</mark>

```mysql
CREATE DATABASE my_cool_db;
```

```mysql
DROP DATABASE my_not_that_cool_db;
```

#### <mark>CREATE  TABLE</mark>

It's easier to do it if you follow the next steps:
1. Define the columns.
2. Specify the primary and foreign keys (if any).
3. Declare the restrictions.


- 1. The simplest definition of a database.

```mysql
CREATE TABLE users(
    name VARCHAR(20),
    passport INTEGER,
    nationality VARCHAR(2),
    fax VARCHAR(15)
    webstyle VARCHAR(10);
);
    

CREATE TABLE countries(
    country_code VARCHAR(2),
    name VARCHAR(20)
);
```

- 2. Note that the order of creation of the tables is important.

```mysql
CREATE TABLE countries(
    country_code VARCHAR(2),
    name VARCHAR(20),
    PRIMARY KEY(country_code)
);


CREATE TABLE users(
    name VARCHAR(20),
    passport INTEGER,
    nationality VARCHAR(2),
    fax VARCHAR(15),
    webstyle VARCHAR(10);
    PRIMARY KEY (passport),
    FOREIGN KEY (nationality) REFERENCES countries(country_code)
);
```

- 3. The `CHECK` statement will set some additional restrictions and prevent some wrong insertions. **Some RDBMS (like MySQL or MariaDB < 10.2.1 ) ignore the `CHECK` statement**.

```mysql
CREATE TABLE countries(
    country_code VARCHAR(2) NOT NULL,
    name VARCHAR(20) NOT NULL,
    population INTEGER,
    PRIMARY KEY(country_code),
    CHECK (population > 0)
);
```

#### <mark>ALTER TABLE</mark>

Modifies an existing table.

##### <mark>Add new column</mark>

```mysql
ALTER TABLE countries ADD (gdp INTEGER NOT NULL, gini DECIMAL(3,2));
```

In [20]:
%%sql
SELECT *
FROM countries;

 * mysql+pymysql://root:***@localhost:3306/newname
25 rows affected.

[('AR', 'Argentina', Decimal('2'), 0),
 ('AU', 'Australia', Decimal('3'), 0),
 ('BE', 'Belgium', Decimal('1'), 0),
 ('BR', 'Brazil', Decimal('2'), 0),
 ('CA', 'Canada', Decimal('2'), 0),
 ('CH', 'Switzerland', Decimal('1'), 0),
 ('CN', 'China', Decimal('3'), 0),
 ('DE', 'Germany', Decimal('1'), 0),
 ('DK', 'Denmark', Decimal('1'), 0),
 ('EG', 'Egypt', Decimal('4'), 0),
 ('FR', 'France', Decimal('1'), 0),
 ('HK', 'HongKong', Decimal('3'), 0),
 ('IL', 'Israel', Decimal('4'), 0),
 ('IN', 'India', Decimal('3'), 0),
 ('IT', 'Italy', Decimal('1'), 0),
 ('JP', 'Japan', Decimal('3'), 0),
 ('KW', 'Kuwait', Decimal('4'), 0),
 ('MX', 'Mexico', Decimal('2'), 0),
 ('NG', 'Nigeria', Decimal('4'), 0),
 ('NL', 'Netherlands', Decimal('1'), 0),
 ('SG', 'Singapore', Decimal('3'), 0),
 ('UK', 'United Kingdom', Decimal('1'), 0),
 ('US', 'United States of America', Decimal('2'), 0),
 ('ZM', 'Zambia', Decimal('4'), 0),
 ('ZW', 'Zimbabwe', Decimal('4'), 0)]

In [ ]:
%%sql
ALTER TABLE countries ADD (gdp INTEGER NOT NULL, gini DECIMAL(3,2));

In [23]:
%%sql
ALTER TABLE countries ADD (gini DECIMAL(3,2));

 * mysql+pymysql://root:***@localhost:3306/newname
25 rows affected.

[]

In [24]:
%%sql
SELECT *
FROM countries;

 * mysql+pymysql://root:***@localhost:3306/newname
25 rows affected.

[('AR', 'Argentina', Decimal('2'), 0, None),
 ('AU', 'Australia', Decimal('3'), 0, None),
 ('BE', 'Belgium', Decimal('1'), 0, None),
 ('BR', 'Brazil', Decimal('2'), 0, None),
 ('CA', 'Canada', Decimal('2'), 0, None),
 ('CH', 'Switzerland', Decimal('1'), 0, None),
 ('CN', 'China', Decimal('3'), 0, None),
 ('DE', 'Germany', Decimal('1'), 0, None),
 ('DK', 'Denmark', Decimal('1'), 0, None),
 ('EG', 'Egypt', Decimal('4'), 0, None),
 ('FR', 'France', Decimal('1'), 0, None),
 ('HK', 'HongKong', Decimal('3'), 0, None),
 ('IL', 'Israel', Decimal('4'), 0, None),
 ('IN', 'India', Decimal('3'), 0, None),
 ('IT', 'Italy', Decimal('1'), 0, None),
 ('JP', 'Japan', Decimal('3'), 0, None),
 ('KW', 'Kuwait', Decimal('4'), 0, None),
 ('MX', 'Mexico', Decimal('2'), 0, None),
 ('NG', 'Nigeria', Decimal('4'), 0, None),
 ('NL', 'Netherlands', Decimal('1'), 0, None),
 ('SG', 'Singapore', Decimal('3'), 0, None),
 ('UK', 'United Kingdom', Decimal('1'), 0, None),
 ('US', 'United States of America', Decimal('2'), 0, None),
 ('ZM', 'Zambia', Decimal('4'), 0, None),
 ('ZW', 'Zimbabwe', Decimal('4'), 0, None)]

##### <mark>Delete a column</mark>

```mysql
ALTER TABLE countries DROP gini;
```

In [25]:
%%sql
ALTER TABLE countries DROP gini;

 * mysql+pymysql://root:***@localhost:3306/newname
25 rows affected.

[]

In [26]:
%%sql
SELECT *
FROM countries
LIMIT 3

 * mysql+pymysql://root:***@localhost:3306/newname
3 rows affected.

[('AR', 'Argentina', Decimal('2'), 0),
 ('AU', 'Australia', Decimal('3'), 0),
 ('BE', 'Belgium', Decimal('1'), 0)]

### Relational Algebra: Rename $\rho$

> A rename is a unary operation written as $\rho_{a/b}(R)$ where:

> * $R$ is a relation  
> * $a$ and $b$ are attribute names  
> * $b$ is an attribute of $R$  

> The result is identical to $R$ except that the $b$ attribute in all tuples is renamed to $a$.

> Example:

> Cars:

> | <span style="color:blue">License</span> | Brand   | Color | Year | Doors |
|-------------------------------------------|---------|-------|------|-------|
| LK3RW0                                    | Renault | Brown | 2011 | 5     |
| 0K13SW                                    | KIA     | Blue  | 2012 | 5     |

> <center>$\rho_{License / NPlate}(Cars)$</center>

> | <span style="color:red">NPlate</span> | Brand   | Color | Year | Doors |
|-----------------------------------------|---------|-------|------|-------|
| LK3RW0                                  | Renault | Brown | 2011 | 5     |
| 0K13SW                                  | KIA     | Blue  | 2012 | 5     |

##### <mark>Rename a table</mark>

```mysql
ALTER TABLE employeees RENAME employees; 
```

##### <mark>Add a foreign key</mark>

```mysql
ALTER TABLE employees ADD (dept_id INTEGER); /* Adds a new column -dept_id- which will contain the foreign key */
ALTER TABLE employees ADD FOREIGN KEY (dept_id) REFERENCES department(id); 
```

##### <mark>Drop foreign key</mark>

```mysql
ALTER TABLE employees DROP FOREIGN KEY employees_ibfk_1;
/* employees_ibfk_1 is the name of the constraint foreign key */
```

#### <mark>DROP TABLE</mark>

![alt text](img/exploits_of_a_mom.png "Little Bobby Tables")
[[Source]](https://xkcd.com/327/)

```mysql
DROP TABLE countries;
```

### <mark>Views</mark>

Views allows us to create a table to show some users only the information we want. They are created from a query as follows:

```mysql
CREATE VIEW view1 AS SELECT not_private_info, not_relevant FROM my_secret_db;
```

A view can be deleted with the following command:

```mysql
DROP VIEW view1;
```

In [27]:
%%sql
SELECT *
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500, 6000, 4000, datetime.datetime(2017, 4, 2, 0, 0), 0),
 (1, 'Charlie', 1500, 3000, 2000, datetime.datetime(2016, 10, 27, 0, 0), 2),
 (2, 'Bob', 2000, 2000, 1750, datetime.datetime(2000, 8, 19, 0, 0), None),
 (3, 'Alice', 4300, 4000, 2000, datetime.datetime(2018, 2, 23, 0, 0), 1)]

In [29]:
%%sql 
CREATE VIEW viewX AS 
SELECT emp_id, emp, sales 
FROM employees;

 * mysql+pymysql://root:***@localhost:3306/newname
0 rows affected.

[]

In [30]:
%%sql
SELECT *
FROM viewX;

 * mysql+pymysql://root:***@localhost:3306/newname
4 rows affected.

[(0, 'Donald', 5500),
 (1, 'Charlie', 1500),
 (2, 'Bob', 2000),
 (3, 'Alice', 4300)]

### SQL General Data Types [[9]](http://www-db.deis.unibo.it/courses/TW/DOCS/w3schools/sql/sql_datatypes_general.asp.html)

| Data type                         | Description                                                                                                                                                                                  |
|-----------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| CHARACTER(n)                      | Character string. Fixed-length n                                                                                                                                                             |
| VARCHAR(n) or CHARACTER VARYING(n) | Character string. Variable length. Maximum length n                                                                                                                                          |
| BINARY(n)                         | Binary string. Fixed-length n                                                                                                                                                                |
| BOOLEAN                           | Stores TRUE or FALSE values                                                                                                                                                                  |
| VARBINARY(n) or BINARY VARYING(n)  | Binary string. Variable length. Maximum length n                                                                                                                                             |
| INTEGER(p)                        | Integer numerical (no decimal). Precision p                                                                                                                                                  |
| SMALLINT                          | Integer numerical (no decimal). Precision 5                                                                                                                                                  |
| INTEGER                           | Integer numerical (no decimal). Precision 10                                                                                                                                                 |
| BIGINT                            | Integer numerical (no decimal). Precision 19                                                                                                                                                 |
| DECIMAL(p,s)                      | Exact numerical, precision p, scale s. Example: decimal(5,2) is a number that has 3 digits before the decimal and 2 digits after the decimal                                                 |
| NUMERIC(p,s)                      | Exact numerical, precision p, scale s. (Same as DECIMAL)                                                                                                                                     |
| FLOAT(p)                          | Approximate numerical, mantissa precision p. A floating number in base 10 exponential notation. The size argument for this type consists of a single number specifying the minimum precision |
| REAL                              | Approximate numerical, mantissa precision 7                                                                                                                                                  |
| FLOAT                             | Approximate numerical, mantissa precision 16                                                                                                                                                 |
| DOUBLE PRECISION                  | Approximate numerical, mantissa precision 16                                                                                                                                                 |
| DATE                              | Stores year, month, and day values                                                                                                                                                           |
| TIME                              | Stores hour, minute, and second values                                                                                                                                                       |
| TIMESTAMP                         | Stores year, month, day, hour, minute, and second values                                                                                                                                     |
| INTERVAL                          | Composed of a number of integer fields, representing a period of time, depending on the type of interval                                                                                     |
| ARRAY                             | A set-length and ordered collection of elements                                                                                                                                              |
| MULTISET                          | A variable-length and unordered collection of elements                                                                                                                                       |
| XML                               | Stores XML data                                                                                                                                                                              |

#### SQL Data Type Quick Reference [[10]](http://www-db.deis.unibo.it/courses/TW/DOCS/w3schools/sql/sql_datatypes_general.asp.html)

| Data type             | Access                 | SQLServer                                          | Oracle          | MySQL      | PostgreSQL      |
|-----------------------|------------------------|----------------------------------------------------|-----------------|------------|-----------------|
| **boolean**           | Yes/No                 | Bit                                                | Byte            | N/A        | Boolean         |
| **integer**           | Number (integer)       | Int                                                | Number          | Int<br/>Integer | Int<br/>Integer      |
| **float**             | Number (single)        | Float<br/>Real                                          | Number          | Float      | Numeric         |
| **currency**          | Currency               | Money                                              | N/A             | N/A        | Money           |
| **string (fixed)**    | N/A                    | Char                                               | Char            | Char       | Char            |
| **string (variable)** | Text (<256)<br/>Memo (65k+) | Varchar                                            | Varchar<br/>Varchar2 | Varchar    | Varchar         |
| **binary object**     | OLE Object Memo        | Binary (fixed up to 8K)<br/>Varbinary (<8K)<br/>Image (<2GB) | Long<br/>Raw         | Blob<br/>Text   | Binary<br/>Varbinary |

![alt text](img/query.png "XKCD query joke")
[[Source]](https://xkcd.com/1409/)

---